
// getCar_ZO1_v2

<?php

// Ubike API的站点信息URL
// $ubike_api_url = 'https://data.ntpc.gov.tw/api/datasets/010e5b15-3823-4b20-b401-b1cf000550c5/json?page=3&size=205';

// 发送HTTP请求获取JSON数据
//$json_data = file_get_contents($ubike_api_url);

// include_once 'readCarByTDX.php';

$filename = 'carData.json'; // 檔案名稱或路徑

// 使用 file_get_contents 讀取檔案
$ubike_api_url = file_get_contents($filename);

if ($ubike_api_url === false) {
    echo "讀取檔案失敗";
} else {
    echo ''; //"檔案內容：\n";
//    echo $ubike_api_url;
}

// 解析JSON数据
$data = json_decode($ubike_api_url, true);

$dictionary = array(
    
    "500218001" => "新北市政府(新府路)",
    "500218002" => "新北市政府(新站路)",
    "500218004" => "板林溪北路口",
    "500218005" => "捷運亞東醫院站(2號出口)",
    "500218006" => "四川遠東路口",
    "500218007" => "環河公園",
    "500218008" => "中華電信學院",
    "500218009" => "漢生東路193巷口",
    "500218010" => "溪洲公園停車場",
    "500218011" => "華德公園",
    "500218012" => "湳雅觀光夜市(津渡橋)",
    "500218013" => "忠孝國中",
    "500218014" => "南雅公園",
    "500218015" => "浮洲合宜住宅(合安一合宜路口)",
    "500218016" => "板橋信義公園",
    "500218017" => "板橋仁愛公園",
    "500218018" => "捷運板新站",
    "500218019" => "捷運新埔民生站",
    "500218020" => "捷運新埔站(5號出口)",
    "500218021" => "捷運新埔站(1號出口)",
    "500218022" => "埤墘公園",
    "500218023" => "健華新城社區",
    "500218024" => "信義公園市民活動中心",
    "500218025" => "板橋和平公園",
    "500218026" => "民生公園",
    "500218027" => "光復高中",
    "500218028" => "永安公園",
    "500218029" => "莊敬公園",
    "500218030" => "板橋地政事務所",
    "500218031" => "四川忠孝路口",
    "500218032" => "板橋真武廟",
    "500218033" => "莒光國小",
    "500218034" => "環河西大漢街口",
    "500218035" => "浮洲合宜住宅(合安一路)",
    "500218036" => "新北市立圖書館總館",
    "500218037" => "板橋福德公園",
    "500218038" => "板橋第一運動場",
    "500218039" => "溪北公園",
    "500218040" => "崑崙活力廣場",
    "500218041" => "浮洲火車站",
    "500218042" => "馥華公園",
    "500218043" => "捷運新埔站(2號出口)",
    "500218044" => "捷運新埔站(4號出口)",
    "500218045" => "捷運板橋站(3號出口)",
    "500218046" => "捷運板橋站(1號出口)",
    "500218047" => "時光公園",
    "500218048" => "江翠國小",
    "500218049" => "仁化文新路口",
    "500218050" => "板橋果菜批發市場",
    "500218051" => "音樂公園",
    "500218052" => "捷運江子翠站(3號出口)",
    "500218053" => "新北市藝文中心",
    "500218054" => "民生長江路口",
    "500218055" => "板橋國中",
    "500218056" => "大觀路二段19巷",
    "500218057" => "永翠藝文街口(大禾社區)",
    "500218058" => "永翠藝文街口(柏克萊公園社區)",
    "500218059" => "藝文二永翠路口(青峰社區)",
    "500218060" => "華江一華江五路口(雙江翠社區)",
    "500218061" => "文化路二段182巷1弄",
    "500218062" => "中正新月二街口(富江翠社區)",
    "500218063" => "浮洲合宜住宅(樂群路)",
    "500218064" => "三抱竹",
    "500218065" => "廣福公園",
    "500218066" => "潤泰社區",
    "500218067" => "永豐公園活動中心",
    "500218068" => "板橋中山公園",
    "500218069" => "浮洲合宜住宅(合宜一路)",
    "500218070" => "崑崙公園",
    "500218071" => "中山國中",
    "500218072" => "振義里公園",
    "500218073" => "民生中山路口",
    "500218074" => "重慶國小",
    "500218075" => "新北市藝文中心(文化路二段124巷)",
    "500218076" => "板橋國民運動中心",
    "500218077" => "臺灣藝術大學",
    "500218078" => "林本源園邸",
    "500218079" => "埔墘國小",
    "500218080" => "石雕公園",
    "500218081" => "萬板文聖街口",
    "500218082" => "光復國小",
    "500218083" => "大觀國中",
    "500218084" => "捷運府中站(1號出口)",
    "500218085" => "文德國小(公館街)",
    "500218086" => "板橋四維公園",
    "500218087" => "四維公園地下停車場",
    "500218088" => "縣民漢生東路口",
    "500218089" => "江翠國中",
    "500218090" => "溪頭公園",
    "500218091" => "華江一華江九路口",
    "500218092" => "新海長江路口",
    "500218093" => "板橋戶政事務所",
    "500218094" => "板橋第二運動場(皇翔建設)",
    "500218095" => "聯合醫院板橋院區",
    "500218096" => "板橋車站",
    "500218097" => "捷運府中站(3號出口)",
    "500218098" => "縣民民族路口",
    "500218099" => "國光里(國光路)",
    "500218100" => "國光公園",
    "500218102" => "西安市民活動中心",
    "500218103" => "板橋重慶公園",
    "500218104" => "華江一華江六路口(仰真社區)",
    "500218105" => "環河西新月一街口(新月天地社區)",
    "500218106" => "藝文藝文二街口(大悅社區)",
    "500218107" => "香社一藝文街口(歡喜市社區)",
    "500218108" => "華江九華江一路口(匯翠社區)",
    "500218109" => "國泰街111巷口",
    "500218110" => "新崑公園",
    "500218111" => "大明街20巷19弄口",
    "500218112" => "港嘴活動中心",
    "500218113" => "三民翠華街口",
    "500218114" => "夢奇地公園(文化路一段)",
    "500218115" => "海山高中",
    "500218116" => "雙十萬板路口",
    "500218117" => "板新中山路一段口",
    "500218118" => "新民民族路口",
    "500218119" => "新月二綠堤街口",
    "500218120" => "華江一華江二路口(江匯Life社區)",
    "500218121" => "信義路163巷口",
    "500218122" => "中正路183巷",
    "500218123" => "黃石中繼市場",
    "500218124" => "信義和平路口",
    "500218126" => "新府區運路口",
    "500218127" => "海山高中(漢生東路)",
    "500218128" => "後埔國小",
    "500218129" => "民生路二段/文化路一段286巷口",
    "500218130" => "文化路一段212巷口",
    "500218131" => "稚匯公園(華江三路)",
    "500218132" => "松柏街15巷口",
    "500218133" => "捷運江子翠站(6號出口)",
    "500218134" => "捷運江子翠站(1號出口)",
    "500218135" => "捷運江子翠站(2號出口)",
    "500218136" => "捷運江子翠站(4號出口)",
    "500218137" => "新北市政府板橋分局沙崙派出所",
    "500218138" => "僑中二街92巷口",
    "500218139" => "浮洲運動公園",
    "500218140" => "大觀路二段265巷3弄口",
    "500218141" => "縣民漢生東路口(西北側)",
    "500218142" => "湳仔溝抽水站",
    "500218143" => "文丘公園",
    "500218144" => "板樹體育館",
    "500218145" => "三民永豐街口",
    "500218146" => "溪城金門街口",
    "500218148" => "縣民民生路口",
    "500218149" => "縣民觀光街口",
    "500218150" => "長安街251巷",
    "500218151" => "府中立體停車場",
    "500218152" => "力行新村",
    "500218153" => "中山路二段416巷38弄口",
    "500218154" => "板橋車站(新站路)",
    "500218155" => "板橋435藝文特區",
    "500218156" => "湳仔二橋",
    "500218157" => "玫瑰公園",
    "500218158" => "萬板高架橋下停車場",
    "500218159" => "新海抽水站停車場",
    "500218160" => "縣民大道三段270巷口",
    "500218161" => "八德公園",
    "500218162" => "華江公園",
    "500218163" => "湳雅夜市停車場",
    "500218164" => "聖若望平面停車場",
    "500218165" => "中山路二段90巷",
    "500218166" => "文聖國小(松柏街50巷)",
    "500218168" => "板橋435藝文特區(環河西路)",
    "500218169" => "大觀段平面停車場",
    "500218170" => "懷石公園",
    "500218171" => "華江二華江一路口(帝國花園廣場社區)",
    "500218172" => "華江五華江一路口(帝國花園廣場社區)",
    "500218173" => "華江一華江二路口(吾界社區)",
    "500218174" => "縣民富山街口",
    "500218176" => "環河西華江六路口(翠亨村社區)",
    "500218044" => "捷運新埔站(4號出口)",
    "500218189" => "文化懷德街口",  
    "500218184" => "華江橋自行車牽引道",
    "500218195" => "江翠國中活動中心地下停車場"
    

    );

$display_sna = [

    "500218021",  //捷運新埔站(1號出口)
    "500218043",  //捷運新埔站(2號出口)
    "500218129",  //民生路二段/文化路一段286巷口
    "500218044",  //捷運新埔站(4號出口)
    "500218020",  //捷運新埔站(5號出口)
    "500218134",  //捷運江子翠站(1號出口)
    "500218135",  //捷運江子翠站(2號出口)
    "500218052",  //捷運江子翠站(3號出口)
    "500218136",  //捷運江子翠站(4號出口)
    "500218133",  //捷運江子翠站(6號出口)
    "500218061",  //文化路二段182巷1弄
    "500218132",  //松柏街15巷口
    "500218072",  //振義里公園
    "500218113",  //三民翠華街口
    "500218145",  //三民永豐街口
    "500218067",  //永豐公園活動中心
    "500218079",  //埔墘國小
    "500218073",  //民生中山路口
    "500218165",  //中山路二段90巷
    "500218102",  //西安市民活動中心
    "500218022",  //埤墘公園
    "500218161",  //八德公園
    "500218029",  //莊敬公園
    "500218162",  //華江公園
    "500218068",  //板橋中山公園
    "500218053",  //新北市藝文中心
    "500218075",  //新北市藝文中心(文化路二段124巷)
    "500218033",  //莒光國小
    "500218174",  //縣民富山街口
    "500218160",  //縣民大道三段270巷口
    "500218028",  //永安公園
    "500218051",  //音樂公園
    "500218170",  //懷石公園
    "500218081",  //萬板文聖街口
    "500218116",  //雙十萬板路口
    "500218048",  //江翠國小
    "500218082",  //光復國小
    "500218027",  //光復高中
    "500218066",  //潤泰社區
    "500218153",  //中山路二段416巷38弄口
    "500218080",  //石雕公園
    "500218089",  //江翠國中
    "500218195",  //江翠國中活動中心地下停車場
    "500218166",  //文聖國小(松柏街50巷)
    "500218049",  //仁化文新路口
    "500218047",  //時光公園
    "500218090",  //溪頭公園
    "500218131",  //稚匯公園(華江三路)
    "500218091",  //華江一華江九路口
    "500218108",  //華江九華江一路口(匯翠社區)
    "500218060",  //華江一華江五路口(雙江翠社區)
    "500218104",  //華江一華江六路口(仰真社區)
    "500218176",  //環河西華江六路口(翠亨村社區)
    "500218120",  //華江一華江二路口(江匯Life社區)
    "500218173",  //華江一華江二路口(吾界社區)
    "500218171",  //華江二華江一路口(帝國花園廣場社區)
    "500218172",  //華江五華江一路口(帝國花園廣場社區)
    "500218184",  //華江橋自行車牽引道  
    "500218189",  //文化懷德街口  
    "500218158",  //萬板高架橋下停車場
    "500218148",  //縣民民生路口
    "500218112"  //港嘴活動中心
   
    ];

$display_red = ['埤墘公園' , '永安公園' , '莒光國小' , '捷運新埔站(2號出口)' , '捷運新埔站(4號出口)' , '音樂公園' , '捷運江子翠站(3號出口)' ,
                '永豐公園活動中心' , '振義里公園' , '民生中山路口' , '埔墘國小' , '萬板文聖街口' , '光復國小' , '三民翠華街口' ];

$display_blue = ['捷運新埔站(1號出口)','中山路二段90巷'];

// 检查是否成功获取数据
if ($data) {

    $CarArray = array();

    for ($i = 0; $i < 200; $i++) {
        // 在每一行宣告一個包含3個元素的子陣列
        $CarArray[$i] = array("", 0, 0);
    }

     // 输出表头
     echo '<table border="1" style="font-size: 48px;">';
     echo '<tr><th>ZO1 站名</th><th>車量</th><th>空柱</th></tr>';

     // 遍历每个站点
     foreach ($data as $station_id => $station_data) {
        // 取出站名 
        $shortened_name = $station_data['StationID'];
        // 取出 ZO1 的站
        if (in_array($shortened_name, $display_sna)) { 
            // 依照站名排序    
            for ($i=0 ; $i<count($display_sna) ; $i++) {
                if ($shortened_name == $display_sna[$i]) {

                    // 由 StationID 查出站名
                    $shortened_name = $dictionary[$shortened_name];

                    $CarArray[$i][0] = $shortened_name;
                    $CarArray[$i][1] = $station_data['AvailableRentBikes'];
                    $CarArray[$i][2] = $station_data['AvailableReturnBikes'];
                    break;
                }    
            } 
        }
     }

     // 顯示結果
     for ($i = 0; $i < count($display_sna); $i++) {

            // 检查是否为需要红色样式的站点
            if(in_array($CarArray[$i][0], $display_red)) {
                $row_style = 'style="color: red;"';
            } else if(in_array($CarArray[$i][0], $display_blue)) {
                $row_style = 'style="color: blue;"';
            } else {
                $row_style = '';
            }

            // $row_style = (in_array($CarArray[$i][0], $display_red)) ? 'style="color: red;"' : '';
 
            $car_style = ($CarArray[$i][1]==0) ? 'color: red;' : 'color: black;';
            $step_style = ($CarArray[$i][2]<=5) ? 'color: red;' : 'color: black;';

            // 输出表格行
            echo '<tr ' . $row_style . '>';
            // echo '<td style="text-align: center;">' . $row_index_in_array . '</td>';
            echo '<td>' . $CarArray[$i][0] . '</td>';

            echo '<td style="text-align: center;' . $car_style . '">' . $CarArray[$i][1] . '</td>';
            echo '<td style="text-align: center;' . $step_style . '">' . $CarArray[$i][2] . '</td>';

            // echo '<td style="text-align: center;">' . $CarArray[$i][1] . '</td>';
            // echo '<td style="text-align: center;">' . $CarArray[$i][2] . '</td>';
            echo '</tr>';

     }
 
     // 输出表格结束标签
     echo '</table>';
} else {
    echo '无法获取Ubike数据';
}

?>
